
# Prime number = যে সংখ্যা কেবল ১ এবং নিজে দিয়ে বিভাজ্য।

# প্রথমে দেখি সংখ্যা ১-এর বেশি কি না।

# এরপর ২ থেকে √num পর্যন্ত চেক করি কোনো ভাগ যায় কি না।

# যদি যায় → প্রাইম নয়।

# যদি না যায় → প্রাইম।
#
# 
# -------------------------------------
#প্রাইম চেক করার সময় আমরা দেখি—

# একটি সংখ্যা n যদি প্রাইম না হয়, তাহলে সেটিকে অবশ্যই দুটি সংখ্যার গুণফল হিসেবে লেখা যায়:
# n=a×b
# এখন, a এবং b — দুটোরই একসাথে √n-এর বেশি হওয়া অসম্ভব।
# কারণ যদি দুটোই √n-এর বেশি হয়, তাদের গুণফল n-এর চেয়ে বড় হয়ে যায়।
# 👉 তাই যেকোনো non-prime সংখ্যার অন্তত একটি গুণনীয়ক থাকে ≤ √n এর মধ্যে।
# এজন্যই শুধু 2 থেকে √n পর্যন্ত চেক করলেই বোঝা যায় সংখ্যা prime কিনা।
# উদাহরণ: n = 36
# √36 = 6
# 36 = 6 × 6
# 36 = 4 × 9
# 36 = 3 × 12
# 36 = 2 × 18
# দেখো—
# প্রতিটি জোড়ার মধ্যে অন্তত একটি সংখ্যা ≤ 6।
# সুতরাং 7, 8, 9 … 36 পর্যন্ত চেক করার দরকার নেই।


num = int(input("Enter a number: "))

if num > 1: 
    for i in range(2,int(num**0.5)+1):
        if num % i ==0:
            print(num, "Is not a prime number")
            break
    else: 
        print(num, "Is ia prime number")
else:  
    print(num, "is not a prime number")